package kz.tamur.rt;

import java.util.ListResourceBundle;

/**
 * Created by IntelliJ IDEA.
 * User: Vital
 * Date: 22.04.2005
 * Time: 15:19:18
 * To change this template use File | Settings | File Templates.
 */
public class RuntimeResources_kk extends ListResourceBundle {
    /*                 
    Ә - \u04d8     ә - \u04d9 
      -              -        
    Ұ - \u04b0     ұ - \u04b1 
      -              -        
    І - \u0406     і - \u0456 
      -              -        
    Ң - \u04a2     ң - \u04a3 
      -              -        
    Ғ - \u0492     ғ - \u0493 
      -              -        
    Ү - \u04ae     ү - \u04af 
      -              -        
    Қ - \u049a     қ - \u049b 
      -              -        
    Ө - \u04e8     ө - \u04e9 
      -              -        
    Һ - \u04ba     һ - \u04bb 
    */
    
    public static final Object[][] contents = {
            {"applyChanges", "\u04e8згерiстерд\u0456 \u049bолдану"},
            {"cancelChanges", "Серверден жа\u04a3арту"},
            {"backPage", "Алдын\u0493ы бет"},
            {"buttonRun", "Келесi \u049bадам"},
            {"nextPage", "Келес\u0456 бет"},                                   
            {"print", "Басып шы\u0493ару"},
            {"processMap", "Процесс схемасы"},
            {"superProcess", "Бас процесс"},
            {"subProcess", "К\u0456ш\u0456процесс"},
            {"debugProcess", "М\u0456нету"},
            {"pwdChange", "\u049a\u04b1пия белг\u0456н\u0456 орнату"},
            {"exchange", "Ж\u04e9нелту/Алу"},
            {"infoStatusExchange", "Алмасу көлігінің мәртебесін тексеру"},
            {"createProcess", "Процесс \u049b\u04b1рылып жатыр!!!"},
            //Buttons description
            {"applyChangesDesc", "Енг\u0456з\u04af интерфейстег\u0456 деректерд\u0456 уа\u049bытша са\u049bтау саласына\n" +
                                 "са\u049bтайды (деректер процесс ая\u049bтал\u0493ан кезде т\u04b1ра\u049bты са\u049bтау\n" +
                                 "саласына жазылады)"},
            {"cancelChangesDesc", "Енг\u0456з\u04af интерфейстег\u0456 деректерд\u0456н м\u04d9н\u0456н ал\u0493аш\u049bы \u049bалпына келт\u0456ред\u0456.\n" +
                                  "Ал\u0493аш\u049bы м\u04d9н\u0456 -  “\u04e8згер\u0456стерд\u0456\u049bолдану” т\u04afймешекпен са\u049bтал\u0493ан\n" +
                                  "деректерд\u0456н м\u04d9н\u0456"},
            {"backPageDesc", "Пайдаланушыны алды\u04a3\u0493ы терезеге \u049bайтып \u04d9келед\u0456. Батырма\n" +
                             "Бас терезен\u0456\u04a3 \u04e8з\u0456нде басылмайды"},
            {"nextPageDesc", "Келес\u0456 бет"},
            {"printDesc", "Шы\u0493ыс \u049b\u04b1жаттардын т\u04e8мен т\u04afсет\u0456н басып шы\u0493ару м\u04d9з\u0456р\u0456н ашады.\n" +
                          "Егер енг\u0456зу нысанында басып шы\u0493ару м\u04afмк\u0456нд\u0456г\u0456 болмаса,\n" +
                          "батырма басылмайды"},
            {"processMapDesc", "Тапсырмалар мониторында\u0493ы б\u04e8л\u0456п к\u04e8рсет\u0456лген жола\u0493ына\n" +
                               "процесс картасыны\u04a3 \u049bарау терезес\u0456н ашады"},
            {"superProcessDesc", "\u04afлкен процесс картасын \u049bарау терезес\u0456не \u049bайтарады.\n" +
                                 "Егер \u04afлкен процесс болмаса, батырма басылмайды"},
            {"subProcessDesc", "К\u0456ш\u0456 процест\u0456 \u049bарау терезес\u0456н ша\u049bырады. Егер к\u0456ш\u0456\n" +
                               "процесс болмаса, батырма басылмайды"},
            {"debugProcessDesc", "Процест\u0456 ауыспалы м\u04d9ндер\u0456н\u0456\u04a3 \u049bарау терезес\u0456н ша\u049bырады.\n" +
                                 "Батырманы Ж\u04afйен\u0456\u04a3 \u04d9к\u0456мш\u0456с\u0456 баса алады"},
            {"pwdChangeDesc", "Парольды ауыстыру диалогыны\u04a3 терезес\u0456н ша\u049bырады"},
            {"exchangeDesc", "Хабарды алу/ж\u04e8нелту \u0456с-\u049bимылыны\u04a3 белсенд\u0456 (орындаушы)\n" +
                             "процес\u0456не бастамашы болады"},
            {"infoExchangeDesc", "Алмасу көлігінің мәртебесін тексереді"},

            {"dataLangDesc", "Деректер т\u0456л\u0456н ауыстыру"},
            {"btnSrvDesc", "Процестерд\u0456 басару режим\u0456не к\u04e8шу"},
            {"btnArhDesc", "Дере\u049b\u049bорыны \u049bарау ж\u04d9не есепт\u0456л\u0456кт\u0456 \u049b\u04b1растыру режим\u0456не к\u04e8шу"},
            {"btnSprDesc", "Нормативт\u0456к-аны\u049bтамалы\u049b а\u049bпаратпен ж\u04b1мыс \u0456стеу режиме к\u04e8шу"},

            {"baseLabelDesc", "Ж\u04afйен\u0456\u04a3 ж\u04b1мыс \u0456стеген дере\u049b\u049bорыны\u04a3 атауы"},
            {"userLabelDesc", "Ж\u04afйеге к\u0456рген пайдаланушыны\u04a3 аты"},
            {"taskTableDesc", "Пайдаланушы немесе байланысты а\u049bпаратты\u049b ж\u04afйе бастамашылы\u049b\n" +
                              "еткен белсенд\u0456 тапсырмалар кестес\u0456"},
            {"taskTableHeaderDesc", "Белсенд\u0456 тапсырмалар кестен\u0456\u04a3 та\u049bырыбы. Кестен\u0456\u04a3 деректер\u0456н\n" +
                                    "с\u04b1рыптау м\u04afмк\u0456н, б\u04b1л \u04afш\u0456н т\u0456нту\u0456рмен кестен\u0456\u04a3 ба\u0493аныны\u04a3 атауыны\u04a3\n" +
                                    "т\u04afрту \u049bажет"},
            {"counterLabelDesc", "Та\u04a3да\u0493ан тапсырманы\u04a3 номер\u0456 мен белсенд\u0456\n" +
                                 "тапсырма жалпы саны"},
            //Main menu
            //File
            {"file", "&aФайл"},
            {"interface", "Интерфейс"},
            {"exit", "Шы\u0493у"},
            {"exitMenu", "&iШы\u0493у"},
            {"open", "Ашу"},
            {"openMenu", "&fАшу"},
            //Settings
            {"settings", "&,Бапталымдар"},
            {"interfaceLang", "&bИнтерфейс тiлi"},
            {"editorSetup", "Шрифты и фон(каз)"},
            {"language", "Язык...(каз)"},
            //Window
            {"window", "&nТерезелер"},
            {"taskMenu", "Та&gпсырмалар"},
            {"archiveMenu", "&vМ\u04b1ра\u0493ат"},
            {"catalogMenu", "А&yны\u049bтамалы\u049bтар"},
            //Help
            {"help", "&/?"},
            {"helpTip", "Ан&sы\u049bтама"},
            {"helpTipShort", "Аны\u049bтама"},
            {"helpTipLong", "Контекст аны\u049bтамасы"},
            {"helpTipDesc", "Выберите интересующий Вас<br/>элемент интерфейса"},
            {"helpMain", "Аны\u049bтама ж\u04e9не \u049aолдау"},
            {"about", "Т&eуралы"},
            {"manual","Руководство пользователя"},
            //
            {"reports", "Есеп хаттар"},
            {"beep", "&lДыбысты\u049b белг\u0456"},
            {"scrollTabProc", "&pСкроллинг закладок"},
            //Dialog buttons
            {"ok", "Жарайды"},
            {"cancel", "Болдырмау"},
            {"refresh", "Жа\u04a3арту"},
            {"yes", "И\u04d9"},
            {"no", "Жо\u049b"},
            {"clear", "Аластау"},
            {"close", "Жабу"},
            {"edit", "Табу"},
            {"continue", "Жал\u0493астыру"},
            {"save", "Са\u049bтау"},
            {"ignore", "Елемеу"},
            {"findBtn", "Табу"},
            {"create", "Создать"},
            {"toBackground", "Фонда орындау"},

            //Application title
            {"app", "ЗТ МД\u049a"},
            {"errors", "Енг\u0456зу \u049bателер"},

            //Messages title
            {"error", "\u049aате"},
            {"confirmation", "\u049a\u04b1птау"},
            {"message", "Хабар"},
            {"alert", "Ескерту"},
            {"option", "Сайлау"},
            {"enterPassword", "Пароль енг\u0456з\u0456\u04a3iз"},

            //Messages
            {"exitMessage", "Ба\u0493дараламадан шы\u0493у\u0493а сен\u0456мд\u0456м\u0456с\u0456з?"},
            {"killProcMessage", " Процест\u0456 болдырмау керек па?"},
            {"checkObjectMessage", "Объект\u0456 та\u04a3да\u04a3ыз"},
            {"ifcNotExistMessage", "Интерфейс та\u0493айындалма\u0493ан"},
            {"rptGenerateMessage", "Отчет формируется"},
            {"procPerformedMessage", "Процедура выполняется"},
            {"nextStepMessage", "Келес\u0456 \u049bадам?"},
            {"startProcMessage", "Процест\u0456 жег\u0456лу керек па"},

            //Labels
            {"datalang", " Деректер т\u0456лi:"},

            //RadioButtons
            {"rusShort", "орыс"},
            {"kazShort", "\u049bаз"},
            //Смена пароля
            {"oldPass", "Еск\u0456 пароль"},
            {"newPass", "Жа\u04a3а пароль"},
            {"confPass", "Растау"},
            {"passChangeTitle", "Парольды аупстыру"},
            {"errorLoginMessage", "Пайдаланушыны\u04a3 аты неиесе\n" + "пароли д\u04b1рыс емес!"},
            {"completeMessage", "Пароль ойда\u0493ыдай \u04e9згерiгдi."},
            {"newPassInvalidMessage", "Жа\u04a3а пароль енгiзiленген жо\u049b!"},
            {"oldPassInvalidMessage", "Ескi пароль \u049bате енгiзiленген!"},
            {"passNotEqualsMessage", "Парольдар д\u04d9л келген жо\u049b!"},
            {"notCompleteMessage", "Керек атрибуттар тол тырылма\u0493ан!"},
            {"passwordTooShort", "Пароль %1% символдан кем\nболмауы ти\u0456с!"},
            {"passwordNotChanged", "Пароль \u04e9згер\u0456лген жо\u049b!"},
            {"passwordExpired", "<html>С\u0456зд\u0456\u04a3 пароль еск\u0456рд\u0456!<br>Осы \u04d9з\u0456рде\n" +
                                "С\u0456зге парольды \u04e9згертуге болады"},

            //LoginBox
            {"login", "Пайдаланушы:"},
            {"password", "Пароль:"},
            {"loginTitle", "Авторландыру"},

            //ServerParams
            {"srvName", "Наименование:"},
            {"host", "IP-адрес:"},
            {"port", "Порт:"},
            {"srvChange", "Смена сервера"},
            {"srvNoChanged", "Данные о сервере не изменились"},

            //FilterDates Dialog
            {"filterDatesTitle", "Уа\u049bытты параметрлерд\u0456 енг\u0456з\u0456\u04a3\u0456з"},
            {"filterDatesBegin", "Бастап\u049bы кезен\u0456"},
            {"filterDatesEnd", "А\u049bыр\u0493ы кезен\u0456"},
            {"filterDatesCurrent", "Текущая дата каз"},
            {"formReport", "2"},
            //TableNavigator
           {"fastRep", "Жылдам есер"},
           {"consal", "Жазбаны бiрiктiру"},
           {"add", "Жазбаны \u049bосу"},
           {"delete", "Жазбаны жою"},
           {"find", "Жазбаны табу"},
           {"filter", "С\u04b1згiнi \u049bолдану"},
           {"copyRows", "Тарма\u049bты к\u04e9шiру"},
           {"goDown", "Ж\u04b1ргiргiнi\u04a3 \u049bоз\u0493алысын ба\u0493ыттау"},
           {"moveDown", "Переместить строку вниз"},
           {"moveUp", "Переместить строку вверх"},
           {"showDeleted", "Показать удаленные значения"},
           {"cancelApplyFilter","С\u04b1згiнi\u04a3 \u049bолданылуы\u04a3 болдырмау"},
           {"selectFilters","С\u04afзгiнi(с\u04AFзгiлердi) та\u04a3да\u04a3ыз"},
            //login,password
            {"wrongLoginOrPassword","Пайдаланушыны\u04a3 аты немесе пароли д\u04b1рыс емес!"},
            {"userHasConnected", "Пайдаланушы ж\u04afйеге \u049bосыл\u0493ан!"},
            {"userHasConnectedSameIP", "Пайдаланушы ж\u04afйеге \u049bосыл\u0493ан! Продолжить вход в Систему?"},
            {"serverDisconnect", "Сервермен байланыс жо\u049b!"},
            {"userIsBlocked", "Есептiк жазба администратормен о\u049bшаулан\u0493ан!"},
            //Date formats and char
            {"mask", "кк.аа.жжжж"},
            {"mask1", "кк.аа.жжжж сс:ММ"},
            {"mask2", "кк.аа.жжжж сс:ММ:сс"},
            {"mask3", "кк.аа.жжжж сс:ММ:сс:ССС"},
            {"mask4", "сс:ММ:сс"},
            {"mask5", "сс:ММ"},
            {"mask6", "кк.аа"},
            {"charD", "к"},
            {"charM", "а"},
            {"charG", "ж"},
            {"charCH", "с"},
            {"charMM", "М"},
            {"charS", "с"},
            {"charSS", "С"},
           // FindRowPanel
           {"findTitle", "Жазбаны табу"},
           {"searchComplete", "\u0406здеу ая\u049bталды.\r\nЖазбы табыл\u0493ан жо\u049b!"},
           {"searchChooseColumn", "\u0406здеу ба\u0493аны та\u04a3даныз"},
           {"findRowInColumn", "ба\u0493анда\u0493ы жазбаны табу"},
           {"case", "Регист\u0456рд\u0456 ескере отырып"},
           {"fullAnalog", "М\u04d9ндер\u0456н\u0456\u04a3 толы\u049b с\u04d9йкест\u0456г\u0456мен"},
           {"firstSymbol", "Бастап\u049bы символдарыны\u04a3 с\u04d9йкест\u0456г\u0456мен"},
           {"containsStr", "Содержит"},

           {"copiesCount", "К\u04e9ш\u0456рме саны"},
           {"beforeAddAction", "Толы\u049bтыру алдында\u0493ы \u0456с-\u049bимыл"},
           {"afterAddAction", "Толы\u049bтырудан кей\u0456нг\u0456 \u0456с-\u049bимыл"},
           {"deleteRowsConfirm", "%1% жазбаны\u04a3 жойылуын раста\u04a3ыз!\n Жал\u0493астыру?"},
           {"deleteRowConfirm", "№ %1% жазбаны\u04a3 жойылуын раста\u04a3ыз!\n Жал\u0493астыру?"},
           {"beforeDeleteAction", "Жою алдында\u0493ы \u0456с-\u049bимыл"},
           {"afterDeleteAction", "Жоюдан кей\u0456нг\u0456 \u0456с-\u049bимыл"},
           // tree
           {"treeCollapse", "А\u0493ашты жабу"},
           {"treeExpand", "А\u0493ашты ашу"},
           {"renameNode", "Торапты \u049bайта атау"},
           {"changeNode", "Торап\u049bа бас\u049bа м\u04d9н та\u0493у"},
           {"createNode", "Торап пен м\u04d9н жасау "},
           {"createNodeBefore", "-"},
           {"createNodeAfter", "-"},
           {"createNodeAndBind", "Торап жасау ж\u04d9не м\u04d9н та\u0493у"},
           {"deleteNode", "Торапты жою"},
           {"expandNode", "Ашу"},
           {"collapseNode", "Жабу"},

           {"renameNodeTitle", "Элементт\u0456 \u049bайта атау"},
           {"bindNodeTitle", "М\u04d9нд\u0456 та\u04a3да\u04a3ыз"},
           {"createNodeTitle", "Жа\u04a3а объект жасау"},
           {"deleteNodeTitle", "Элемент(терд\u0456) жою?"},

           {"duplicateData", "Назар аудары\u04a3ыз! Деректер \u049bайталанады"},
           {"enterFolderName", "Папканы\u04a3 атауын енг\u0456з\u0456\u04a3\u0456з"},
           {"enterElementName", "Элементт\u0456\u04a3 атауын енг\u0456з\u0456\u04a3\u0456з"},
           {"enterIntCopyName", "Интерфейс к\u04e9ш\u0456рмес\u0456н\u0456\u04a3 атауын енг\u0456з\u0456\u04a3\u0456з"},
           {"download", "Т\u04afс\u0456ру"},
           {"upload", "Ж\u04afктеу"},
           {"view", "\u049aарау"},
           {"fileNotFound", "Файл табылмады"},
           {"fileNotAppend", "Файл бек\u0456т\u0456лмеген"},

           {"upFolder", "Б\u0456р де\u04a3гейге жо\u0493ары"},
           {"createFolder", "Папка жасау"},
           {"list", "Т\u0456з\u0456м"},
           {"table", "Кесте"},
           {"findIn", "...-дан \u0456здеу"},
           {"saveIn", "...-да са\u049bтау"},
           {"fileTypes", "Файлдарды\u04a3 \u04afлг\u0456лер\u0456"},
           {"fileName", "Файлды\u04a3 аты"},
           {"fileSize", "М\u04e9лшер\u0456"},
           {"fileType", "\u04aeлг\u0456с\u0456"},
           {"fileDate", "К\u04afн\u0456"},
           {"fileAttr", "Атрибут"},
           {"desktop", "Ж\u04b1мысшы м\u04d9з\u0456р"},

           {"openFile", "Файлды ашу"},
           {"openFileTitle", "Файлды ашу"},
           {"docs", "Word, Excel \u049b\u04b1жаттар"},
           {"pictures", "GIF, JPG суреттер"},

           {"noname", "Аты жо\u049b"},
           {"nocomment", "Т\u04afс\u0456н\u0456к жо\u049b"},

           {"sendToDeveloper", "Отправить разработчику"},
           
         //For Terminal use, rewrite it please
           {"run", "Орындау"},
           {"resetData", "Жою"},
           {"clear2", "Аршу"},
           {"clearConsole", "Консольды босату"},
           {"server", "Сервер"},
           {"client", "Клиент"},
           {"properties", "\u049aасиеттер"},
           {"informations", "М\u04d9л\u0456меттер"},
           {"key", "к\u0456лт"},
           {"value", "ма\u0493ына"},
           {"type", "т\u04afр"},
           {"process", "Процесстер"},
           {"setHotKey", "Тез клавишт\u0456 салу"},
           {"lastSrv", "Со\u04a3\u0493ы процесстер"},
           {"runSrv", "Процессты орындау"},
           {"searchSrv", "Процессты \u0456здеу"},
           {"clickToSet", "Назначить нажатием"},
           {"description", "Сипаттама"},
           {"next", "Келес\u0456"},
           {"pleaseInsertWord", "С\u04e9зд\u0456 енг\u0456з\u0456\u04a3\u0456з"},
           {"withFolders", "папкалар да"},
           {"contain", "\u049a\u04b1рамында"},
           {"startsWith", "Басталады"},
           {"endsWith", "Б\u0456тед\u0456"},
           {"hotKeys", "Тез клавишттер"},
           {"search", "\u0406здеу"},
           {"not_found", "табыл\u0493ан жо\u049b"},
           
           // верификация пароля
           {"validPwdMinLogin","\u049aолданушыны\u04a3 аты X нышандардан аз болмау керек!"},
           {"validPwdMaxLogin","Пайдаланушыны\u04a3 аты Х та\u04a3баларынан кем болмайды!"},
           {"validPwdmMinPass","Пароль X нышандардан аз болмау керек!"},
           {"validPwdmMaxPass","\u049a\u04b1пия с\u04e9з Х та\u04a3баларынан арты\u049b болмайды!"},
           {"validPwdMinPassAdm","Администратор \u04afш\u0456н пароль X нышандардан аз болмау керек!"},
           {"validPwdNoNumb","Парольде цифрлер \u049bатысуы ти\u0456ст\u0456!"},
           {"validPwdNoAllNumb","Парольде цифрлер коп болмау керек!"},
           {"validPwdNoSymb","Парольде \u04d9р\u0456птер \u049bатысуы ти\u0456ст\u0456!"},
           {"validPwdNoReg","Парольде \u04d9р\u0456птер\u0456 \u04d9р т\u04afрл\u0456 регистрде болуы ти\u0456ст\u0456!"},
           {"validPwdNoSpec","Парольде арнайы нышандар \u049bатысуы ти\u0456ст\u0456!"},
           {"validPwdNotName","Парольде \u049bолданушыны\u04a3 атыны \u049bолдану\u0493а тыйым салынады!"},
           {"validPwdNotSurn","Парольде \u049bолданушыны\u04a3 фамилиясыны \u049bолдану\u0493а тыйым салынады!"},
           {"validPwdNotTel","Парольде телефондарды\u04a3 н\u04e9м\u0456рлер\u0456н \u049bолдану\u0493а тыйым салынады!"},
           {"validPwdNotWord","Парольде жи\u0456 \u049bолданатын с\u04e9здерд\u0456 \u049bолдану\u0493а тыйым салынады!"},
           {"validPwdNotKeyboard","Парольде пернета\u049bта с\u04e9здер\u0456н \u049bолдану\u0493а тыйым салынады!"},
           {"validPwdNotRep","\u049a\u04b1пия с\u04e9зде б\u0456р\u0456нш\u0456 \u04afш та\u04a3баларды\u04a3 \u049bайталануына тыйым салынады!"},
           {"validPwdNotRepAnyMoreTwo","\u049a\u04b1пия с\u04e9зде \u049bатар т\u04b1р\u0493ан 2 та\u04a3бадан к\u04e9п б\u0456рдей та\u04a3балар \u049bайталануына тыйым салынады!"},
           {"validPwdNotLogin","Парольде \u049bолданушыны\u04a3 логин\u0456 \u049bолдану\u0493а тыйым салынады!"},
           {"validPwdNotIdentificationData","В пароле запрещено использовать собственные идентификационные данные!"},
           
           // сообщения авторизации пользователя
           {"messAccessDenied","Ба\u0493дарлама\u0493а к\u0456руге тыйым салынады!\nС\u0456зге пароль ауыстыру \u049bажет!"},
           {"messNotBD","С\u0456зге ж\u04b1мыс деректер \u049bоры белг\u0456ленбеген. \u04e8з администраторы\u04a3ыз\u0493а хабарласыныз."},
           {"messNotLangInf","С\u0456зге интерфейс т\u0456л\u0456 белг\u0456ленбеген. \u04e8з администраторыныз\u0493а хабарласыныз."},
           {"messNotLangData","С\u0456зге деректер \u049bоры т\u0456л\u0456 белг\u0456ленбеген. \u04e8з администраторыныз\u0493а хабарласы\u04a3ыз."},
           {"messFirstLogin","<html>Б\u04b1л С\u0456зд\u0456\u04a3 б\u0456р\u0456нш\u0456 авторизация\u04a3ыз.<br>Парольд\u0456 \u04e9згерту \u049bажет!"},
           {"messPassEnded","<html>Парольд\u0456\u04a3 мерз\u0456м\u0456 ая\u049bталды.<br>Парольд\u0456 \u04e9згерту \u049bажет!"},
           {"messMinPeriodPass","Парольд\u0456 т\u04d9ул\u0456кте X реттен к\u04e9п ауыстыру\u0493а тыйым салынады!"},
           {"messPassIdent","Енг\u0456з\u0456лген пароль б\u04b1рын\u0493ы парольды \u049bайталамау керек!"},
           {"messPassDupl","Пароль б\u04b1рын\u0493ы X парольдерд\u0456 \u049bайталамау керек!"},
           {"recordNotActiv","Доступ запрещен!\nИстекло время активации вашей учётной записи!"},
           // диаграмма
           {"notData","Нет данных для отображения!"},
        // Календарик
           {"okDate","Подтвердить выбор"},
           {"cancelDate","Отменить выбор"},
           {"todayDate","Установить текущую"},
           {"backMonth","Предыдущий месяц"},
           {"nextMonth","Следующий месяц"},
           {"backYear","Предыдущий год"},
           {"nextYear","Следующий год"},
           //
           {"delete2", "Жою"},

           {"key-choose-dialog-title", "Укажите путь к ключевому файлу"},
           {"key-choose-button-title", "Выбрать"},
           {"key-choose-p12-desc", "Файлы ключей ЭЦП в формате PKCS12"},
           {"key-choose-label", "Ключевой файл"},
           {"key-choose-tooltip", "Выбрать файл с ключом ЭЦП"},
           

           {"firstPage", "Б\u0456р\u0456нш\u0456 бет"},
           {"lastPage", "Со\u04a3\u0493ы бет"},
           {"confInterface", "Конфигурация интерфейсов"},
           {"maxSize", "Бейне \u04e9лшем  XXXKB кедерг\u0456 жасал\u0493ан!"},
           {"stateFind", "\u0406здест\u0456ру ж\u04afрг\u0456з\u0456л\u0456п жатыр...\u0406здест\u0456руд\u0456 болдырмау \u04afш\u0456н Esc пернес\u0456н басы\u04a3ыз"}
    };

    protected Object[][] getContents() {
        return contents;
    }
}
